{
  "backend/main.mo": "Empty Motoko actor placeholder with no logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten 1–2 sentence descriptions of all frontend source files.",
  "frontend/index.css": "Tailwind base/style config defining global theme tokens and dark mode variables.",
  "frontend/index.html": "HTML entry point that loads the React application root and main module.",
  "frontend/src/App.tsx": "Main React app wiring BPM simulation, lockout trigger, and conditional lockout overlay.",
  "frontend/src/components/BoxBreathing.tsx": "Animated 4‑phase box‑breathing component with phase‑change callbacks.",
  "frontend/src/components/BpmLineGraph.tsx": "SVG line graph rendering BPM history with scaling and optional 100‑BPM threshold line.",
  "frontend/src/components/DashboardScreen.tsx": "Dashboard UI showing BPM, graph, spike button, and rage text shield.",
  "frontend/src/components/InterventionPanel.tsx": "Box‑breathing panel with looping countdown and audio‑cue integration via Web Audio hook.",
  "frontend/src/components/LockoutOverlay.tsx": "Full‑screen lockout overlay with entrance animation, audio toggle, intervention panel, and timer.",
  "frontend/src/components/RageTextShield.tsx": "A text input component that animates and clears user-entered text with a dissolving effect.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useBreathingAudioCues.ts": "Generates short audio tones for breathing phases using the Web Audio API with controlled activation and cleanup.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useLockout.ts": "Implements a timed lockout mechanism with countdown tracking and reactivation after expiration.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are used.",
  "frontend/src/hooks/useSimulatedBpm.ts": "Simulates BPM readings with noise, spikes, and a rolling 30‑second history buffer.",
  "frontend/src/index.css": "Tailwind setup with theme variables, dark mode styles, and custom animation keyframes.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, and Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color variables, animations, and plugins.",
  "project_state.json": "Defines the project’s versioned state for an AI stress‑response app, listing architectural notes, existing features, and requirements. Captures UI, animation, BPM logic, and intervention components planned or completed."
}